#ifndef	__TIMER_H
#define	__TIMER_H

#include "sys.h"

//------------------------------------------------------------------------------------------------
// TIMx_IT_Update_time = (TIMx_Reload_Num + 1) * ( TIMx_Frequency_Divide + 1 ) / TIMx_input_CLK
//   TIMx溢出时间   		 重装载值					分频系数				 TIMx的输入时钟
//------------------------------------------------------------------------------------------------

// 20ms中断一次
//------------------------------------------------------------------------------------------------
#define	TIM2_Frequency_Divide	71		// TIM2时钟预分频值
#define	TIM2_Reload_Num			19999	// 自动重装载寄存器的值
// 分频系数=71 => 每计数一次的周期 = 1s/(72MHz/(71+1)) = 1us

// 向上技术模式下：重装载值=19999 => 计数20000次，用时20ms（装填重装载值时，耗一个时钟周期）
//------------------------------------------------------------------------------------------------

void TIM2_Time_Init(void) ;
//void TIM3_Time_Init(void);
extern u8 cnt;
extern u8 dht11_cnt;
#endif	/* __TIMER_H */
